---
kind: type
id: T:Autodesk.Revit.DB.MEPCurve
source: html/38714847-0f40-7021-aa79-2884c3a02ce2.htm
---
# Autodesk.Revit.DB.MEPCurve

A curve object for duct or pipe blend elements.

## Syntax (C#)
```csharp
public class MEPCurve : HostObject
```

## Remarks
The curve object is only available in the Autodesk Revit MEP product.